app/Controllers/Product.php

    public function index()
    {

        $products = $this->productModel->paginate(1, 'products');
---
SELECT *
FROM `products`
 LIMIT 3, 1
SELECT COUNT(*) AS `numrows`
FROM `products`

    public function create()
    {

        $fileName = "";

        $photo = $this->request->getFile('photo');

        if ($photo) {
            $fileName = $photo->getRandomName(); // Mendapatkan nama file baru secara acak

            $photo->move('photos', $fileName); // Memindahkan file ke public/photos dengan nama acak
        }

        $payload = [
            "name" => $this->request->getPost('name'),
            "stock" => (int) $this->request->getPost('stock'),
            "price" => (int) $this->request->getPost('price'),
            "category" => $this->request->getPost('category'),
            "photo" => $fileName, // Kita simpan nama filenya saja
        ];

        $this->productModel->insert($payload);
---
INSERT INTO `products` (`name`, `stock`, `price`, `category`, `photo`) VALUES ('Pulpen', 100, 5000, 'utilities', '1684044582_07580f287dd9d6f01442.png')

    public function edit($id = null)
    {
        $product = $this->productModel->find($id);
---
SELECT *
FROM `products`
WHERE `products`.`id` = '1'